; ModuleID = 'tiny.c'
source_filename = "tiny.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mime_map = type { i8*, i8* }
%struct.rio_t = type { i32, i32, i8*, [1024 x i8] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.http_request = type { [512 x i8], i64, i64 }

@.str = private unnamed_addr constant [5 x i8] c".css\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"text/css\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c".gif\00", align 1
@.str.3 = private unnamed_addr constant [10 x i8] c"image/gif\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c".htm\00", align 1
@.str.5 = private unnamed_addr constant [10 x i8] c"text/html\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c".html\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c".jpeg\00", align 1
@.str.8 = private unnamed_addr constant [11 x i8] c"image/jpeg\00", align 1
@.str.9 = private unnamed_addr constant [5 x i8] c".jpg\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "meme_types", scope: !2, file: !3, line: 43, type: !53, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !18, globals: !49, nameTableKind: None)
!3 = !DIFile(filename: "tiny.c", directory: "/root/hydrogen/TestPrograms/TinyWebServer/TWS-Correct")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !6, line: 24, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/bits/socket_type.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17}
!9 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!14 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!15 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!16 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!17 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!18 = !{!19, !20, !21, !23, !29, !30, !40, !43}
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !24, line: 30, baseType: !25)
!24 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 26, baseType: !27)
!26 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !28, line: 42, baseType: !7)
!28 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "SA", file: !3, line: 30, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !33, line: 178, size: 128, elements: !34)
!33 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "")
!34 = !{!35, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !32, file: !33, line: 180, baseType: !36, size: 16)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !37, line: 28, baseType: !29)
!37 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "")
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !32, file: !33, line: 181, baseType: !39, size: 112, offset: 16)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 112, elements: !41)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !{!42}
!42 = !DISubrange(count: 14)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !44, line: 72, baseType: !45)
!44 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48}
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!0, !50}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "default_mime_type", scope: !2, file: !3, line: 60, type: !52, isLocal: false, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1792, elements: !41)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "mime_map", file: !3, line: 41, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 38, size: 128, elements: !56)
!56 = !{!57, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !55, file: !3, line: 39, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !55, file: !3, line: 40, baseType: !58, size: 64, offset: 64)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{i32 1, !"wchar_size", i32 4}
!64 = !{i32 7, !"PIC Level", i32 2}
!65 = !{i32 7, !"PIE Level", i32 2}
!66 = !{!"clang version 8.0.0 (tags/RELEASE_800/final)"}
!67 = distinct !DISubprogram(name: "rio_readinitb", scope: !3, file: !3, line: 62, type: !68, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !48}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio_t", file: !3, line: 27, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 22, size: 8320, elements: !73)
!73 = !{!74, !75, !76, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rio_fd", scope: !72, file: !3, line: 23, baseType: !48, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "rio_cnt", scope: !72, file: !3, line: 24, baseType: !48, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rio_bufptr", scope: !72, file: !3, line: 25, baseType: !52, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "rio_buf", scope: !72, file: !3, line: 26, baseType: !78, size: 8192, offset: 128)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8192, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 1024)
!81 = !{}
!82 = !DILocalVariable(name: "rp", arg: 1, scope: !67, file: !3, line: 62, type: !70)
!83 = !DILocation(line: 62, column: 27, scope: !67)
!84 = !DILocalVariable(name: "fd", arg: 2, scope: !67, file: !3, line: 62, type: !48)
!85 = !DILocation(line: 62, column: 35, scope: !67)
!86 = !DILocation(line: 63, column: 16, scope: !67)
!87 = !DILocation(line: 63, column: 3, scope: !67)
!88 = !DILocation(line: 63, column: 7, scope: !67)
!89 = !DILocation(line: 63, column: 14, scope: !67)
!90 = !DILocation(line: 64, column: 3, scope: !67)
!91 = !DILocation(line: 64, column: 7, scope: !67)
!92 = !DILocation(line: 64, column: 15, scope: !67)
!93 = !DILocation(line: 65, column: 20, scope: !67)
!94 = !DILocation(line: 65, column: 24, scope: !67)
!95 = !DILocation(line: 65, column: 3, scope: !67)
!96 = !DILocation(line: 65, column: 7, scope: !67)
!97 = !DILocation(line: 65, column: 18, scope: !67)
!98 = !DILocation(line: 66, column: 1, scope: !67)
!99 = distinct !DISubprogram(name: "writen", scope: !3, file: !3, line: 68, type: !100, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !48, !20, !106}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !103, line: 108, baseType: !104)
!103 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !28, line: 193, baseType: !105)
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 62, baseType: !108)
!107 = !DIFile(filename: "/usr/lib/clang/8.0.0/include/stddef.h", directory: "")
!108 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!109 = !DILocalVariable(name: "fd", arg: 1, scope: !99, file: !3, line: 68, type: !48)
!110 = !DILocation(line: 68, column: 20, scope: !99)
!111 = !DILocalVariable(name: "usrbuf", arg: 2, scope: !99, file: !3, line: 68, type: !20)
!112 = !DILocation(line: 68, column: 30, scope: !99)
!113 = !DILocalVariable(name: "n", arg: 3, scope: !99, file: !3, line: 68, type: !106)
!114 = !DILocation(line: 68, column: 45, scope: !99)
!115 = !DILocalVariable(name: "nleft", scope: !99, file: !3, line: 69, type: !106)
!116 = !DILocation(line: 69, column: 10, scope: !99)
!117 = !DILocation(line: 69, column: 18, scope: !99)
!118 = !DILocalVariable(name: "nwritten", scope: !99, file: !3, line: 70, type: !102)
!119 = !DILocation(line: 70, column: 11, scope: !99)
!120 = !DILocalVariable(name: "bufp", scope: !99, file: !3, line: 71, type: !52)
!121 = !DILocation(line: 71, column: 9, scope: !99)
!122 = !DILocation(line: 71, column: 16, scope: !99)
!123 = !DILocation(line: 73, column: 3, scope: !99)
!124 = !DILocation(line: 73, column: 10, scope: !99)
!125 = !DILocation(line: 73, column: 16, scope: !99)
!126 = !DILocation(line: 74, column: 27, scope: !127)
!127 = distinct !DILexicalBlock(scope: !128, file: !3, line: 74, column: 9)
!128 = distinct !DILexicalBlock(scope: !99, file: !3, line: 73, column: 20)
!129 = !DILocation(line: 74, column: 31, scope: !127)
!130 = !DILocation(line: 74, column: 37, scope: !127)
!131 = !DILocation(line: 74, column: 21, scope: !127)
!132 = !DILocation(line: 74, column: 19, scope: !127)
!133 = !DILocation(line: 74, column: 45, scope: !127)
!134 = !DILocation(line: 74, column: 9, scope: !128)
!135 = !DILocation(line: 75, column: 11, scope: !136)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 75, column: 11)
!137 = distinct !DILexicalBlock(scope: !127, file: !3, line: 74, column: 50)
!138 = !DILocation(line: 75, column: 17, scope: !136)
!139 = !DILocation(line: 75, column: 11, scope: !137)
!140 = !DILocation(line: 76, column: 18, scope: !136)
!141 = !DILocation(line: 76, column: 9, scope: !136)
!142 = !DILocation(line: 78, column: 9, scope: !136)
!143 = !DILocation(line: 79, column: 5, scope: !137)
!144 = !DILocation(line: 80, column: 14, scope: !128)
!145 = !DILocation(line: 80, column: 11, scope: !128)
!146 = !DILocation(line: 81, column: 13, scope: !128)
!147 = !DILocation(line: 81, column: 10, scope: !128)
!148 = distinct !{!148, !123, !149}
!149 = !DILocation(line: 82, column: 3, scope: !99)
!150 = !DILocation(line: 83, column: 10, scope: !99)
!151 = !DILocation(line: 83, column: 3, scope: !99)
!152 = !DILocation(line: 84, column: 1, scope: !99)
!153 = distinct !DISubprogram(name: "rio_readlineb", scope: !3, file: !3, line: 125, type: !154, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!154 = !DISubroutineType(types: !155)
!155 = !{!102, !70, !20, !106}
!156 = !DILocalVariable(name: "rp", arg: 1, scope: !153, file: !3, line: 125, type: !70)
!157 = !DILocation(line: 125, column: 30, scope: !153)
!158 = !DILocalVariable(name: "usrbuf", arg: 2, scope: !153, file: !3, line: 125, type: !20)
!159 = !DILocation(line: 125, column: 40, scope: !153)
!160 = !DILocalVariable(name: "maxlen", arg: 3, scope: !153, file: !3, line: 125, type: !106)
!161 = !DILocation(line: 125, column: 55, scope: !153)
!162 = !DILocalVariable(name: "n", scope: !153, file: !3, line: 126, type: !48)
!163 = !DILocation(line: 126, column: 7, scope: !153)
!164 = !DILocalVariable(name: "rc", scope: !153, file: !3, line: 126, type: !48)
!165 = !DILocation(line: 126, column: 10, scope: !153)
!166 = !DILocalVariable(name: "c", scope: !153, file: !3, line: 127, type: !40)
!167 = !DILocation(line: 127, column: 8, scope: !153)
!168 = !DILocalVariable(name: "bufp", scope: !153, file: !3, line: 127, type: !52)
!169 = !DILocation(line: 127, column: 12, scope: !153)
!170 = !DILocation(line: 127, column: 19, scope: !153)
!171 = !DILocation(line: 129, column: 10, scope: !172)
!172 = distinct !DILexicalBlock(scope: !153, file: !3, line: 129, column: 3)
!173 = !DILocation(line: 129, column: 8, scope: !172)
!174 = !DILocation(line: 129, column: 15, scope: !175)
!175 = distinct !DILexicalBlock(scope: !172, file: !3, line: 129, column: 3)
!176 = !DILocation(line: 129, column: 19, scope: !175)
!177 = !DILocation(line: 129, column: 17, scope: !175)
!178 = !DILocation(line: 129, column: 3, scope: !172)
!179 = !DILocation(line: 130, column: 24, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !3, line: 130, column: 9)
!181 = distinct !DILexicalBlock(scope: !175, file: !3, line: 129, column: 31)
!182 = !DILocation(line: 130, column: 15, scope: !180)
!183 = !DILocation(line: 130, column: 13, scope: !180)
!184 = !DILocation(line: 130, column: 36, scope: !180)
!185 = !DILocation(line: 130, column: 9, scope: !181)
!186 = !DILocation(line: 131, column: 17, scope: !187)
!187 = distinct !DILexicalBlock(scope: !180, file: !3, line: 130, column: 41)
!188 = !DILocation(line: 131, column: 12, scope: !187)
!189 = !DILocation(line: 131, column: 15, scope: !187)
!190 = !DILocation(line: 132, column: 11, scope: !191)
!191 = distinct !DILexicalBlock(scope: !187, file: !3, line: 132, column: 11)
!192 = !DILocation(line: 132, column: 13, scope: !191)
!193 = !DILocation(line: 132, column: 11, scope: !187)
!194 = !DILocation(line: 133, column: 9, scope: !191)
!195 = !DILocation(line: 134, column: 5, scope: !187)
!196 = !DILocation(line: 134, column: 16, scope: !197)
!197 = distinct !DILexicalBlock(scope: !180, file: !3, line: 134, column: 16)
!198 = !DILocation(line: 134, column: 19, scope: !197)
!199 = !DILocation(line: 134, column: 16, scope: !180)
!200 = !DILocation(line: 135, column: 11, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !3, line: 135, column: 11)
!202 = distinct !DILexicalBlock(scope: !197, file: !3, line: 134, column: 24)
!203 = !DILocation(line: 135, column: 13, scope: !201)
!204 = !DILocation(line: 135, column: 11, scope: !202)
!205 = !DILocation(line: 136, column: 9, scope: !201)
!206 = !DILocation(line: 138, column: 9, scope: !201)
!207 = !DILocation(line: 140, column: 7, scope: !197)
!208 = !DILocation(line: 141, column: 3, scope: !181)
!209 = !DILocation(line: 129, column: 28, scope: !175)
!210 = !DILocation(line: 129, column: 3, scope: !175)
!211 = distinct !{!211, !178, !212}
!212 = !DILocation(line: 141, column: 3, scope: !172)
!213 = !DILocation(line: 142, column: 4, scope: !153)
!214 = !DILocation(line: 142, column: 9, scope: !153)
!215 = !DILocation(line: 143, column: 10, scope: !153)
!216 = !DILocation(line: 143, column: 3, scope: !153)
!217 = !DILocation(line: 144, column: 1, scope: !153)
!218 = distinct !DISubprogram(name: "rio_read", scope: !3, file: !3, line: 96, type: !219, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !81)
!219 = !DISubroutineType(types: !220)
!220 = !{!102, !70, !52, !106}
!221 = !DILocalVariable(name: "rp", arg: 1, scope: !218, file: !3, line: 96, type: !70)
!222 = !DILocation(line: 96, column: 32, scope: !218)
!223 = !DILocalVariable(name: "usrbuf", arg: 2, scope: !218, file: !3, line: 96, type: !52)
!224 = !DILocation(line: 96, column: 42, scope: !218)
!225 = !DILocalVariable(name: "n", arg: 3, scope: !218, file: !3, line: 96, type: !106)
!226 = !DILocation(line: 96, column: 57, scope: !218)
!227 = !DILocalVariable(name: "cnt", scope: !218, file: !3, line: 97, type: !48)
!228 = !DILocation(line: 97, column: 7, scope: !218)
!229 = !DILocation(line: 98, column: 3, scope: !218)
!230 = !DILocation(line: 98, column: 10, scope: !218)
!231 = !DILocation(line: 98, column: 14, scope: !218)
!232 = !DILocation(line: 98, column: 22, scope: !218)
!233 = !DILocation(line: 100, column: 24, scope: !234)
!234 = distinct !DILexicalBlock(scope: !218, file: !3, line: 98, column: 27)
!235 = !DILocation(line: 100, column: 28, scope: !234)
!236 = !DILocation(line: 100, column: 36, scope: !234)
!237 = !DILocation(line: 100, column: 40, scope: !234)
!238 = !DILocation(line: 100, column: 19, scope: !234)
!239 = !DILocation(line: 100, column: 5, scope: !234)
!240 = !DILocation(line: 100, column: 9, scope: !234)
!241 = !DILocation(line: 100, column: 17, scope: !234)
!242 = !DILocation(line: 102, column: 9, scope: !243)
!243 = distinct !DILexicalBlock(scope: !234, file: !3, line: 102, column: 9)
!244 = !DILocation(line: 102, column: 13, scope: !243)
!245 = !DILocation(line: 102, column: 21, scope: !243)
!246 = !DILocation(line: 102, column: 9, scope: !234)
!247 = !DILocation(line: 103, column: 11, scope: !248)
!248 = distinct !DILexicalBlock(scope: !249, file: !3, line: 103, column: 11)
!249 = distinct !DILexicalBlock(scope: !243, file: !3, line: 102, column: 25)
!250 = !DILocation(line: 103, column: 17, scope: !248)
!251 = !DILocation(line: 103, column: 11, scope: !249)
!252 = !DILocation(line: 104, column: 9, scope: !248)
!253 = !DILocation(line: 105, column: 5, scope: !249)
!254 = !DILocation(line: 106, column: 14, scope: !255)
!255 = distinct !DILexicalBlock(scope: !243, file: !3, line: 106, column: 14)
!256 = !DILocation(line: 106, column: 18, scope: !255)
!257 = !DILocation(line: 106, column: 26, scope: !255)
!258 = !DILocation(line: 106, column: 14, scope: !243)
!259 = !DILocation(line: 107, column: 7, scope: !255)
!260 = !DILocation(line: 109, column: 24, scope: !255)
!261 = !DILocation(line: 109, column: 28, scope: !255)
!262 = !DILocation(line: 109, column: 7, scope: !255)
!263 = !DILocation(line: 109, column: 11, scope: !255)
!264 = !DILocation(line: 109, column: 22, scope: !255)
!265 = distinct !{!265, !229, !266}
!266 = !DILocation(line: 110, column: 3, scope: !218)
!267 = !DILocation(line: 113, column: 9, scope: !218)
!268 = !DILocation(line: 113, column: 7, scope: !218)
!269 = !DILocation(line: 114, column: 7, scope: !270)
!270 = distinct !DILexicalBlock(scope: !218, file: !3, line: 114, column: 7)
!271 = !DILocation(line: 114, column: 11, scope: !270)
!272 = !DILocation(line: 114, column: 21, scope: !270)
!273 = !DILocation(line: 114, column: 19, scope: !270)
!274 = !DILocation(line: 114, column: 7, scope: !218)
!275 = !DILocation(line: 115, column: 11, scope: !270)
!276 = !DILocation(line: 115, column: 15, scope: !270)
!277 = !DILocation(line: 115, column: 9, scope: !270)
!278 = !DILocation(line: 115, column: 5, scope: !270)
!279 = !DILocation(line: 116, column: 10, scope: !218)
!280 = !DILocation(line: 116, column: 18, scope: !218)
!281 = !DILocation(line: 116, column: 22, scope: !218)
!282 = !DILocation(line: 116, column: 34, scope: !218)
!283 = !DILocation(line: 116, column: 3, scope: !218)
!284 = !DILocation(line: 117, column: 21, scope: !218)
!285 = !DILocation(line: 117, column: 3, scope: !218)
!286 = !DILocation(line: 117, column: 7, scope: !218)
!287 = !DILocation(line: 117, column: 18, scope: !218)
!288 = !DILocation(line: 118, column: 18, scope: !218)
!289 = !DILocation(line: 118, column: 3, scope: !218)
!290 = !DILocation(line: 118, column: 7, scope: !218)
!291 = !DILocation(line: 118, column: 15, scope: !218)
!292 = !DILocation(line: 119, column: 10, scope: !218)
!293 = !DILocation(line: 119, column: 3, scope: !218)
!294 = !DILocation(line: 120, column: 1, scope: !218)
!295 = distinct !DISubprogram(name: "format_size", scope: !3, file: !3, line: 146, type: !296, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !52, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !300, line: 46, size: 1152, elements: !301)
!300 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!301 = !{!302, !304, !306, !308, !310, !312, !314, !315, !316, !318, !320, !322, !330, !331, !332}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !299, file: !300, line: 48, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !28, line: 145, baseType: !108)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !299, file: !300, line: 53, baseType: !305, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !28, line: 148, baseType: !108)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !299, file: !300, line: 61, baseType: !307, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !28, line: 151, baseType: !108)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !299, file: !300, line: 62, baseType: !309, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !28, line: 150, baseType: !7)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !299, file: !300, line: 64, baseType: !311, size: 32, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !28, line: 146, baseType: !7)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !299, file: !300, line: 65, baseType: !313, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !28, line: 147, baseType: !7)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !299, file: !300, line: 67, baseType: !48, size: 32, offset: 288)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !299, file: !300, line: 69, baseType: !303, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !299, file: !300, line: 74, baseType: !317, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 152, baseType: !105)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !299, file: !300, line: 78, baseType: !319, size: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !28, line: 174, baseType: !105)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !299, file: !300, line: 80, baseType: !321, size: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !28, line: 179, baseType: !105)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !299, file: !300, line: 91, baseType: !323, size: 128, offset: 576)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !324, line: 9, size: 128, elements: !325)
!324 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!325 = !{!326, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !323, file: !324, line: 11, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !28, line: 160, baseType: !105)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !323, file: !324, line: 12, baseType: !329, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !28, line: 196, baseType: !105)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !299, file: !300, line: 92, baseType: !323, size: 128, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !299, file: !300, line: 93, baseType: !323, size: 128, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !299, file: !300, line: 106, baseType: !333, size: 192, offset: 960)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 192, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 3)
!336 = !DILocalVariable(name: "buf", arg: 1, scope: !295, file: !3, line: 146, type: !52)
!337 = !DILocation(line: 146, column: 24, scope: !295)
!338 = !DILocalVariable(name: "stat", arg: 2, scope: !295, file: !3, line: 146, type: !298)
!339 = !DILocation(line: 146, column: 42, scope: !295)
!340 = !DILocation(line: 147, column: 6, scope: !341)
!341 = distinct !DILexicalBlock(scope: !295, file: !3, line: 147, column: 6)
!342 = !DILocation(line: 147, column: 6, scope: !295)
!343 = !DILocation(line: 148, column: 13, scope: !344)
!344 = distinct !DILexicalBlock(scope: !341, file: !3, line: 147, column: 29)
!345 = !DILocation(line: 148, column: 5, scope: !344)
!346 = !DILocation(line: 149, column: 3, scope: !344)
!347 = !DILocalVariable(name: "size", scope: !348, file: !3, line: 150, type: !349)
!348 = distinct !DILexicalBlock(scope: !341, file: !3, line: 149, column: 10)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !103, line: 85, baseType: !317)
!350 = !DILocation(line: 150, column: 11, scope: !348)
!351 = !DILocation(line: 150, column: 18, scope: !348)
!352 = !DILocation(line: 150, column: 24, scope: !348)
!353 = !DILocation(line: 151, column: 8, scope: !354)
!354 = distinct !DILexicalBlock(scope: !348, file: !3, line: 151, column: 8)
!355 = !DILocation(line: 151, column: 13, scope: !354)
!356 = !DILocation(line: 151, column: 8, scope: !348)
!357 = !DILocation(line: 152, column: 15, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !3, line: 151, column: 20)
!359 = !DILocation(line: 152, column: 27, scope: !358)
!360 = !DILocation(line: 152, column: 7, scope: !358)
!361 = !DILocation(line: 153, column: 5, scope: !358)
!362 = !DILocation(line: 153, column: 16, scope: !363)
!363 = distinct !DILexicalBlock(scope: !354, file: !3, line: 153, column: 16)
!364 = !DILocation(line: 153, column: 21, scope: !363)
!365 = !DILocation(line: 153, column: 16, scope: !354)
!366 = !DILocation(line: 154, column: 15, scope: !367)
!367 = distinct !DILexicalBlock(scope: !363, file: !3, line: 153, column: 35)
!368 = !DILocation(line: 154, column: 37, scope: !367)
!369 = !DILocation(line: 154, column: 29, scope: !367)
!370 = !DILocation(line: 154, column: 42, scope: !367)
!371 = !DILocation(line: 154, column: 7, scope: !367)
!372 = !DILocation(line: 155, column: 5, scope: !367)
!373 = !DILocation(line: 155, column: 16, scope: !374)
!374 = distinct !DILexicalBlock(scope: !363, file: !3, line: 155, column: 16)
!375 = !DILocation(line: 155, column: 21, scope: !374)
!376 = !DILocation(line: 155, column: 16, scope: !363)
!377 = !DILocation(line: 156, column: 15, scope: !378)
!378 = distinct !DILexicalBlock(scope: !374, file: !3, line: 155, column: 42)
!379 = !DILocation(line: 156, column: 37, scope: !378)
!380 = !DILocation(line: 156, column: 29, scope: !378)
!381 = !DILocation(line: 156, column: 42, scope: !378)
!382 = !DILocation(line: 156, column: 49, scope: !378)
!383 = !DILocation(line: 156, column: 7, scope: !378)
!384 = !DILocation(line: 157, column: 5, scope: !378)
!385 = !DILocation(line: 158, column: 15, scope: !386)
!386 = distinct !DILexicalBlock(scope: !374, file: !3, line: 157, column: 12)
!387 = !DILocation(line: 158, column: 37, scope: !386)
!388 = !DILocation(line: 158, column: 29, scope: !386)
!389 = !DILocation(line: 158, column: 42, scope: !386)
!390 = !DILocation(line: 158, column: 49, scope: !386)
!391 = !DILocation(line: 158, column: 56, scope: !386)
!392 = !DILocation(line: 158, column: 7, scope: !386)
!393 = !DILocation(line: 161, column: 1, scope: !295)
!394 = distinct !DISubprogram(name: "handle_directory_request", scope: !3, file: !3, line: 163, type: !395, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !48, !48, !52}
!397 = !DILocalVariable(name: "out_fd", arg: 1, scope: !394, file: !3, line: 163, type: !48)
!398 = !DILocation(line: 163, column: 35, scope: !394)
!399 = !DILocalVariable(name: "dir_fd", arg: 2, scope: !394, file: !3, line: 163, type: !48)
!400 = !DILocation(line: 163, column: 47, scope: !394)
!401 = !DILocalVariable(name: "filename", arg: 3, scope: !394, file: !3, line: 163, type: !52)
!402 = !DILocation(line: 163, column: 61, scope: !394)
!403 = !DILocalVariable(name: "buf", scope: !394, file: !3, line: 164, type: !78)
!404 = !DILocation(line: 164, column: 8, scope: !394)
!405 = !DILocalVariable(name: "m_time", scope: !394, file: !3, line: 164, type: !406)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 32)
!409 = !DILocation(line: 164, column: 22, scope: !394)
!410 = !DILocalVariable(name: "size", scope: !394, file: !3, line: 164, type: !411)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 16)
!414 = !DILocation(line: 164, column: 34, scope: !394)
!415 = !DILocalVariable(name: "statbuf", scope: !394, file: !3, line: 165, type: !299)
!416 = !DILocation(line: 165, column: 15, scope: !394)
!417 = !DILocation(line: 166, column: 11, scope: !394)
!418 = !DILocation(line: 166, column: 3, scope: !394)
!419 = !DILocation(line: 172, column: 10, scope: !394)
!420 = !DILocation(line: 172, column: 18, scope: !394)
!421 = !DILocation(line: 172, column: 30, scope: !394)
!422 = !DILocation(line: 172, column: 23, scope: !394)
!423 = !DILocation(line: 172, column: 3, scope: !394)
!424 = !DILocalVariable(name: "d", scope: !394, file: !3, line: 173, type: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !427, line: 127, baseType: !428)
!427 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !427, line: 127, flags: DIFlagFwdDecl)
!429 = !DILocation(line: 173, column: 8, scope: !394)
!430 = !DILocation(line: 173, column: 22, scope: !394)
!431 = !DILocation(line: 173, column: 12, scope: !394)
!432 = !DILocalVariable(name: "dp", scope: !394, file: !3, line: 174, type: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !435, line: 22, size: 2240, elements: !436)
!435 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!436 = !{!437, !438, !439, !440, !442}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !434, file: !435, line: 25, baseType: !305, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !434, file: !435, line: 26, baseType: !317, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !434, file: !435, line: 31, baseType: !29, size: 16, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !434, file: !435, line: 32, baseType: !441, size: 8, offset: 144)
!441 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !434, file: !435, line: 33, baseType: !443, size: 2048, offset: 152)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 256)
!446 = !DILocation(line: 174, column: 18, scope: !394)
!447 = !DILocalVariable(name: "ffd", scope: !394, file: !3, line: 175, type: !48)
!448 = !DILocation(line: 175, column: 7, scope: !394)
!449 = !DILocation(line: 176, column: 3, scope: !394)
!450 = !DILocation(line: 176, column: 24, scope: !394)
!451 = !DILocation(line: 176, column: 16, scope: !394)
!452 = !DILocation(line: 176, column: 14, scope: !394)
!453 = !DILocation(line: 176, column: 28, scope: !394)
!454 = !DILocation(line: 177, column: 16, scope: !455)
!455 = distinct !DILexicalBlock(scope: !456, file: !3, line: 177, column: 8)
!456 = distinct !DILexicalBlock(scope: !394, file: !3, line: 176, column: 36)
!457 = !DILocation(line: 177, column: 20, scope: !455)
!458 = !DILocation(line: 177, column: 9, scope: !455)
!459 = !DILocation(line: 177, column: 33, scope: !455)
!460 = !DILocation(line: 177, column: 44, scope: !455)
!461 = !DILocation(line: 177, column: 48, scope: !455)
!462 = !DILocation(line: 177, column: 37, scope: !455)
!463 = !DILocation(line: 177, column: 8, scope: !456)
!464 = !DILocation(line: 178, column: 7, scope: !465)
!465 = distinct !DILexicalBlock(scope: !455, file: !3, line: 177, column: 62)
!466 = distinct !{!466, !449, !467}
!467 = !DILocation(line: 195, column: 3, scope: !394)
!468 = !DILocation(line: 180, column: 23, scope: !469)
!469 = distinct !DILexicalBlock(scope: !456, file: !3, line: 180, column: 9)
!470 = !DILocation(line: 180, column: 31, scope: !469)
!471 = !DILocation(line: 180, column: 35, scope: !469)
!472 = !DILocation(line: 180, column: 16, scope: !469)
!473 = !DILocation(line: 180, column: 14, scope: !469)
!474 = !DILocation(line: 180, column: 54, scope: !469)
!475 = !DILocation(line: 180, column: 9, scope: !456)
!476 = !DILocation(line: 181, column: 14, scope: !477)
!477 = distinct !DILexicalBlock(scope: !469, file: !3, line: 180, column: 60)
!478 = !DILocation(line: 181, column: 18, scope: !477)
!479 = !DILocation(line: 181, column: 7, scope: !477)
!480 = !DILocation(line: 182, column: 7, scope: !477)
!481 = !DILocation(line: 184, column: 11, scope: !456)
!482 = !DILocation(line: 184, column: 5, scope: !456)
!483 = !DILocation(line: 185, column: 14, scope: !456)
!484 = !DILocation(line: 186, column: 51, scope: !456)
!485 = !DILocation(line: 186, column: 32, scope: !456)
!486 = !DILocation(line: 185, column: 5, scope: !456)
!487 = !DILocation(line: 187, column: 17, scope: !456)
!488 = !DILocation(line: 187, column: 5, scope: !456)
!489 = !DILocation(line: 188, column: 8, scope: !490)
!490 = distinct !DILexicalBlock(scope: !456, file: !3, line: 188, column: 8)
!491 = !DILocation(line: 188, column: 33, scope: !490)
!492 = !DILocation(line: 188, column: 36, scope: !490)
!493 = !DILocation(line: 188, column: 8, scope: !456)
!494 = !DILocalVariable(name: "d", scope: !495, file: !3, line: 189, type: !52)
!495 = distinct !DILexicalBlock(scope: !490, file: !3, line: 188, column: 61)
!496 = !DILocation(line: 189, column: 13, scope: !495)
!497 = !DILocation(line: 189, column: 17, scope: !495)
!498 = !DILocation(line: 190, column: 15, scope: !495)
!499 = !DILocation(line: 191, column: 15, scope: !495)
!500 = !DILocation(line: 191, column: 19, scope: !495)
!501 = !DILocation(line: 191, column: 27, scope: !495)
!502 = !DILocation(line: 191, column: 30, scope: !495)
!503 = !DILocation(line: 191, column: 34, scope: !495)
!504 = !DILocation(line: 191, column: 42, scope: !495)
!505 = !DILocation(line: 191, column: 45, scope: !495)
!506 = !DILocation(line: 191, column: 53, scope: !495)
!507 = !DILocation(line: 190, column: 7, scope: !495)
!508 = !DILocation(line: 192, column: 14, scope: !495)
!509 = !DILocation(line: 192, column: 22, scope: !495)
!510 = !DILocation(line: 192, column: 34, scope: !495)
!511 = !DILocation(line: 192, column: 27, scope: !495)
!512 = !DILocation(line: 192, column: 7, scope: !495)
!513 = !DILocation(line: 193, column: 5, scope: !495)
!514 = !DILocation(line: 194, column: 11, scope: !456)
!515 = !DILocation(line: 194, column: 5, scope: !456)
!516 = !DILocation(line: 196, column: 11, scope: !394)
!517 = !DILocation(line: 196, column: 3, scope: !394)
!518 = !DILocation(line: 197, column: 10, scope: !394)
!519 = !DILocation(line: 197, column: 18, scope: !394)
!520 = !DILocation(line: 197, column: 30, scope: !394)
!521 = !DILocation(line: 197, column: 23, scope: !394)
!522 = !DILocation(line: 197, column: 3, scope: !394)
!523 = !DILocation(line: 198, column: 12, scope: !394)
!524 = !DILocation(line: 198, column: 3, scope: !394)
!525 = !DILocation(line: 199, column: 1, scope: !394)
!526 = distinct !DISubprogram(name: "open_listenfd", scope: !3, file: !3, line: 216, type: !527, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!527 = !DISubroutineType(types: !528)
!528 = !{!48, !48}
!529 = !DILocalVariable(name: "port", arg: 1, scope: !526, file: !3, line: 216, type: !48)
!530 = !DILocation(line: 216, column: 23, scope: !526)
!531 = !DILocalVariable(name: "listenfd", scope: !526, file: !3, line: 217, type: !48)
!532 = !DILocation(line: 217, column: 7, scope: !526)
!533 = !DILocalVariable(name: "optval", scope: !526, file: !3, line: 217, type: !48)
!534 = !DILocation(line: 217, column: 17, scope: !526)
!535 = !DILocalVariable(name: "serveraddr", scope: !526, file: !3, line: 218, type: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !24, line: 237, size: 128, elements: !537)
!537 = !{!538, !539, !543, !547}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !536, file: !24, line: 239, baseType: !36, size: 16)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !536, file: !24, line: 240, baseType: !540, size: 16, offset: 16)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !24, line: 119, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 25, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !28, line: 40, baseType: !29)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !536, file: !24, line: 241, baseType: !544, size: 32, offset: 32)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !24, line: 31, size: 32, elements: !545)
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !544, file: !24, line: 33, baseType: !23, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !536, file: !24, line: 244, baseType: !548, size: 64, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 64, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 8)
!551 = !DILocation(line: 218, column: 22, scope: !526)
!552 = !DILocation(line: 221, column: 19, scope: !553)
!553 = distinct !DILexicalBlock(scope: !526, file: !3, line: 221, column: 7)
!554 = !DILocation(line: 221, column: 17, scope: !553)
!555 = !DILocation(line: 221, column: 52, scope: !553)
!556 = !DILocation(line: 221, column: 7, scope: !526)
!557 = !DILocation(line: 222, column: 5, scope: !553)
!558 = !DILocation(line: 225, column: 18, scope: !559)
!559 = distinct !DILexicalBlock(scope: !526, file: !3, line: 225, column: 7)
!560 = !DILocation(line: 226, column: 18, scope: !559)
!561 = !DILocation(line: 225, column: 7, scope: !559)
!562 = !DILocation(line: 226, column: 55, scope: !559)
!563 = !DILocation(line: 225, column: 7, scope: !526)
!564 = !DILocation(line: 227, column: 5, scope: !559)
!565 = !DILocation(line: 231, column: 18, scope: !566)
!566 = distinct !DILexicalBlock(scope: !526, file: !3, line: 231, column: 7)
!567 = !DILocation(line: 232, column: 18, scope: !566)
!568 = !DILocation(line: 231, column: 7, scope: !566)
!569 = !DILocation(line: 232, column: 55, scope: !566)
!570 = !DILocation(line: 231, column: 7, scope: !526)
!571 = !DILocation(line: 233, column: 5, scope: !566)
!572 = !DILocation(line: 237, column: 3, scope: !526)
!573 = !DILocation(line: 238, column: 14, scope: !526)
!574 = !DILocation(line: 238, column: 25, scope: !526)
!575 = !DILocation(line: 239, column: 32, scope: !526)
!576 = !DILocation(line: 239, column: 14, scope: !526)
!577 = !DILocation(line: 239, column: 23, scope: !526)
!578 = !DILocation(line: 239, column: 30, scope: !526)
!579 = !DILocation(line: 240, column: 47, scope: !526)
!580 = !DILocation(line: 240, column: 31, scope: !526)
!581 = !DILocation(line: 240, column: 25, scope: !526)
!582 = !DILocation(line: 240, column: 14, scope: !526)
!583 = !DILocation(line: 240, column: 23, scope: !526)
!584 = !DILocation(line: 241, column: 12, scope: !585)
!585 = distinct !DILexicalBlock(scope: !526, file: !3, line: 241, column: 7)
!586 = !DILocation(line: 241, column: 22, scope: !585)
!587 = !DILocation(line: 241, column: 7, scope: !585)
!588 = !DILocation(line: 241, column: 61, scope: !585)
!589 = !DILocation(line: 241, column: 7, scope: !526)
!590 = !DILocation(line: 242, column: 5, scope: !585)
!591 = !DILocation(line: 245, column: 14, scope: !592)
!592 = distinct !DILexicalBlock(scope: !526, file: !3, line: 245, column: 7)
!593 = !DILocation(line: 245, column: 7, scope: !592)
!594 = !DILocation(line: 245, column: 33, scope: !592)
!595 = !DILocation(line: 245, column: 7, scope: !526)
!596 = !DILocation(line: 246, column: 5, scope: !592)
!597 = !DILocation(line: 247, column: 10, scope: !526)
!598 = !DILocation(line: 247, column: 3, scope: !526)
!599 = !DILocation(line: 248, column: 1, scope: !526)
!600 = distinct !DISubprogram(name: "url_decode", scope: !3, file: !3, line: 250, type: !601, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !52, !52, !48}
!603 = !DILocalVariable(name: "src", arg: 1, scope: !600, file: !3, line: 250, type: !52)
!604 = !DILocation(line: 250, column: 23, scope: !600)
!605 = !DILocalVariable(name: "dest", arg: 2, scope: !600, file: !3, line: 250, type: !52)
!606 = !DILocation(line: 250, column: 34, scope: !600)
!607 = !DILocalVariable(name: "max", arg: 3, scope: !600, file: !3, line: 250, type: !48)
!608 = !DILocation(line: 250, column: 44, scope: !600)
!609 = !DILocalVariable(name: "p", scope: !600, file: !3, line: 251, type: !52)
!610 = !DILocation(line: 251, column: 9, scope: !600)
!611 = !DILocation(line: 251, column: 13, scope: !600)
!612 = !DILocalVariable(name: "code", scope: !600, file: !3, line: 252, type: !613)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 24, elements: !334)
!614 = !DILocation(line: 252, column: 8, scope: !600)
!615 = !DILocation(line: 253, column: 3, scope: !600)
!616 = !DILocation(line: 253, column: 10, scope: !600)
!617 = !DILocation(line: 253, column: 9, scope: !600)
!618 = !DILocation(line: 253, column: 12, scope: !600)
!619 = !DILocation(line: 253, column: 15, scope: !600)
!620 = !DILocation(line: 0, scope: !600)
!621 = !DILocation(line: 254, column: 9, scope: !622)
!622 = distinct !DILexicalBlock(scope: !623, file: !3, line: 254, column: 8)
!623 = distinct !DILexicalBlock(scope: !600, file: !3, line: 253, column: 22)
!624 = !DILocation(line: 254, column: 8, scope: !622)
!625 = !DILocation(line: 254, column: 11, scope: !622)
!626 = !DILocation(line: 254, column: 8, scope: !623)
!627 = !DILocation(line: 255, column: 7, scope: !628)
!628 = distinct !DILexicalBlock(scope: !622, file: !3, line: 254, column: 19)
!629 = !DILocation(line: 255, column: 20, scope: !628)
!630 = !DILocation(line: 256, column: 31, scope: !628)
!631 = !DILocation(line: 256, column: 23, scope: !628)
!632 = !DILocation(line: 256, column: 17, scope: !628)
!633 = !DILocation(line: 256, column: 12, scope: !628)
!634 = !DILocation(line: 256, column: 15, scope: !628)
!635 = !DILocation(line: 257, column: 9, scope: !628)
!636 = !DILocation(line: 258, column: 5, scope: !628)
!637 = !DILocation(line: 259, column: 19, scope: !638)
!638 = distinct !DILexicalBlock(scope: !622, file: !3, line: 258, column: 12)
!639 = !DILocation(line: 259, column: 17, scope: !638)
!640 = !DILocation(line: 259, column: 12, scope: !638)
!641 = !DILocation(line: 259, column: 15, scope: !638)
!642 = distinct !{!642, !615, !643}
!643 = !DILocation(line: 261, column: 3, scope: !600)
!644 = !DILocation(line: 262, column: 4, scope: !600)
!645 = !DILocation(line: 262, column: 9, scope: !600)
!646 = !DILocation(line: 263, column: 1, scope: !600)
!647 = distinct !DISubprogram(name: "parse_request", scope: !3, file: !3, line: 265, type: !648, scopeLine: 265, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !48, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_request", file: !3, line: 36, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 32, size: 4224, elements: !653)
!653 = !{!654, !658, !659}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !652, file: !3, line: 33, baseType: !655, size: 4096)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !652, file: !3, line: 34, baseType: !349, size: 64, offset: 4096)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !652, file: !3, line: 35, baseType: !106, size: 64, offset: 4160)
!660 = !DILocalVariable(name: "fd", arg: 1, scope: !647, file: !3, line: 265, type: !48)
!661 = !DILocation(line: 265, column: 24, scope: !647)
!662 = !DILocalVariable(name: "req", arg: 2, scope: !647, file: !3, line: 265, type: !650)
!663 = !DILocation(line: 265, column: 42, scope: !647)
!664 = !DILocalVariable(name: "rio", scope: !647, file: !3, line: 266, type: !71)
!665 = !DILocation(line: 266, column: 9, scope: !647)
!666 = !DILocalVariable(name: "buf", scope: !647, file: !3, line: 267, type: !78)
!667 = !DILocation(line: 267, column: 8, scope: !647)
!668 = !DILocalVariable(name: "method", scope: !647, file: !3, line: 267, type: !78)
!669 = !DILocation(line: 267, column: 22, scope: !647)
!670 = !DILocalVariable(name: "uri", scope: !647, file: !3, line: 267, type: !78)
!671 = !DILocation(line: 267, column: 39, scope: !647)
!672 = !DILocation(line: 268, column: 3, scope: !647)
!673 = !DILocation(line: 268, column: 8, scope: !647)
!674 = !DILocation(line: 268, column: 15, scope: !647)
!675 = !DILocation(line: 269, column: 3, scope: !647)
!676 = !DILocation(line: 269, column: 8, scope: !647)
!677 = !DILocation(line: 269, column: 12, scope: !647)
!678 = !DILocation(line: 271, column: 23, scope: !647)
!679 = !DILocation(line: 271, column: 3, scope: !647)
!680 = !DILocation(line: 272, column: 23, scope: !647)
!681 = !DILocation(line: 272, column: 3, scope: !647)
!682 = !DILocation(line: 273, column: 10, scope: !647)
!683 = !DILocation(line: 273, column: 24, scope: !647)
!684 = !DILocation(line: 273, column: 32, scope: !647)
!685 = !DILocation(line: 273, column: 3, scope: !647)
!686 = !DILocation(line: 275, column: 3, scope: !647)
!687 = !DILocation(line: 275, column: 9, scope: !647)
!688 = !DILocation(line: 275, column: 16, scope: !647)
!689 = !DILocation(line: 275, column: 24, scope: !647)
!690 = !DILocation(line: 275, column: 27, scope: !647)
!691 = !DILocation(line: 275, column: 34, scope: !647)
!692 = !DILocation(line: 0, scope: !647)
!693 = !DILocation(line: 276, column: 25, scope: !694)
!694 = distinct !DILexicalBlock(scope: !647, file: !3, line: 275, column: 43)
!695 = !DILocation(line: 276, column: 5, scope: !694)
!696 = !DILocation(line: 277, column: 8, scope: !697)
!697 = distinct !DILexicalBlock(scope: !694, file: !3, line: 277, column: 8)
!698 = !DILocation(line: 277, column: 15, scope: !697)
!699 = !DILocation(line: 277, column: 22, scope: !697)
!700 = !DILocation(line: 277, column: 25, scope: !697)
!701 = !DILocation(line: 277, column: 32, scope: !697)
!702 = !DILocation(line: 277, column: 39, scope: !697)
!703 = !DILocation(line: 277, column: 42, scope: !697)
!704 = !DILocation(line: 277, column: 49, scope: !697)
!705 = !DILocation(line: 277, column: 8, scope: !694)
!706 = !DILocation(line: 278, column: 14, scope: !707)
!707 = distinct !DILexicalBlock(scope: !697, file: !3, line: 277, column: 56)
!708 = !DILocation(line: 278, column: 44, scope: !707)
!709 = !DILocation(line: 278, column: 49, scope: !707)
!710 = !DILocation(line: 278, column: 58, scope: !707)
!711 = !DILocation(line: 278, column: 63, scope: !707)
!712 = !DILocation(line: 278, column: 7, scope: !707)
!713 = !DILocation(line: 280, column: 11, scope: !714)
!714 = distinct !DILexicalBlock(scope: !707, file: !3, line: 280, column: 11)
!715 = !DILocation(line: 280, column: 16, scope: !714)
!716 = !DILocation(line: 280, column: 20, scope: !714)
!717 = !DILocation(line: 280, column: 11, scope: !707)
!718 = !DILocation(line: 280, column: 26, scope: !714)
!719 = !DILocation(line: 280, column: 31, scope: !714)
!720 = !DILocation(line: 280, column: 35, scope: !714)
!721 = !DILocation(line: 281, column: 5, scope: !707)
!722 = distinct !{!722, !686, !723}
!723 = !DILocation(line: 282, column: 3, scope: !647)
!724 = !DILocalVariable(name: "filename", scope: !647, file: !3, line: 283, type: !52)
!725 = !DILocation(line: 283, column: 9, scope: !647)
