; ModuleID = 'tiny.c'
source_filename = "tiny.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mime_map = type { i8*, i8* }
%struct.rio_t = type { i32, i32, i8*, [1024 x i8] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.http_request = type { [512 x i8], i64, i64 }

@.str = private unnamed_addr constant [5 x i8] c".css\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"text/css\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c".gif\00", align 1
@.str.3 = private unnamed_addr constant [10 x i8] c"image/gif\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c".htm\00", align 1
@.str.5 = private unnamed_addr constant [10 x i8] c"text/html\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c".html\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c".jpeg\00", align 1
@.str.8 = private unnamed_addr constant [11 x i8] c"image/jpeg\00", align 1
@.str.9 = private unnamed_addr constant [5 x i8] c".jpg\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "meme_types", scope: !2, file: !3, line: 43, type: !53, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !18, globals: !49, nameTableKind: None)
!3 = !DIFile(filename: "tiny.c", directory: "/root/hydrogen/TestPrograms/TinyWebServer/TWS-Bug-2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !6, line: 24, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/bits/socket_type.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17}
!9 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!14 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!15 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!16 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!17 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!18 = !{!19, !20, !21, !23, !29, !30, !40, !43}
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !24, line: 30, baseType: !25)
!24 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 26, baseType: !27)
!26 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !28, line: 42, baseType: !7)
!28 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "SA", file: !3, line: 30, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !33, line: 178, size: 128, elements: !34)
!33 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "")
!34 = !{!35, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !32, file: !33, line: 180, baseType: !36, size: 16)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !37, line: 28, baseType: !29)
!37 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "")
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !32, file: !33, line: 181, baseType: !39, size: 112, offset: 16)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 112, elements: !41)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !{!42}
!42 = !DISubrange(count: 14)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !44, line: 72, baseType: !45)
!44 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48}
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!0, !50}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "default_mime_type", scope: !2, file: !3, line: 59, type: !52, isLocal: false, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1664, elements: !61)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "mime_map", file: !3, line: 41, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 38, size: 128, elements: !56)
!56 = !{!57, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !55, file: !3, line: 39, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !55, file: !3, line: 40, baseType: !58, size: 64, offset: 64)
!61 = !{!62}
!62 = !DISubrange(count: 13)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{i32 1, !"wchar_size", i32 4}
!66 = !{i32 7, !"PIC Level", i32 2}
!67 = !{i32 7, !"PIE Level", i32 2}
!68 = !{!"clang version 8.0.0 (tags/RELEASE_800/final)"}
!69 = distinct !DISubprogram(name: "rio_readinitb", scope: !3, file: !3, line: 61, type: !70, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !48}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "rio_t", file: !3, line: 27, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 22, size: 8320, elements: !75)
!75 = !{!76, !77, !78, !79}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rio_fd", scope: !74, file: !3, line: 23, baseType: !48, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "rio_cnt", scope: !74, file: !3, line: 24, baseType: !48, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "rio_bufptr", scope: !74, file: !3, line: 25, baseType: !52, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "rio_buf", scope: !74, file: !3, line: 26, baseType: !80, size: 8192, offset: 128)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8192, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1024)
!83 = !{}
!84 = !DILocalVariable(name: "rp", arg: 1, scope: !69, file: !3, line: 61, type: !72)
!85 = !DILocation(line: 61, column: 27, scope: !69)
!86 = !DILocalVariable(name: "fd", arg: 2, scope: !69, file: !3, line: 61, type: !48)
!87 = !DILocation(line: 61, column: 35, scope: !69)
!88 = !DILocation(line: 62, column: 18, scope: !69)
!89 = !DILocation(line: 62, column: 5, scope: !69)
!90 = !DILocation(line: 62, column: 9, scope: !69)
!91 = !DILocation(line: 62, column: 16, scope: !69)
!92 = !DILocation(line: 63, column: 5, scope: !69)
!93 = !DILocation(line: 63, column: 9, scope: !69)
!94 = !DILocation(line: 63, column: 17, scope: !69)
!95 = !DILocation(line: 64, column: 22, scope: !69)
!96 = !DILocation(line: 64, column: 26, scope: !69)
!97 = !DILocation(line: 64, column: 5, scope: !69)
!98 = !DILocation(line: 64, column: 9, scope: !69)
!99 = !DILocation(line: 64, column: 20, scope: !69)
!100 = !DILocation(line: 65, column: 1, scope: !69)
!101 = distinct !DISubprogram(name: "writen", scope: !3, file: !3, line: 67, type: !102, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!102 = !DISubroutineType(types: !103)
!103 = !{!104, !48, !20, !108}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !105, line: 108, baseType: !106)
!105 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !28, line: 193, baseType: !107)
!107 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 62, baseType: !110)
!109 = !DIFile(filename: "/usr/lib/clang/8.0.0/include/stddef.h", directory: "")
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = !DILocalVariable(name: "fd", arg: 1, scope: !101, file: !3, line: 67, type: !48)
!112 = !DILocation(line: 67, column: 20, scope: !101)
!113 = !DILocalVariable(name: "usrbuf", arg: 2, scope: !101, file: !3, line: 67, type: !20)
!114 = !DILocation(line: 67, column: 30, scope: !101)
!115 = !DILocalVariable(name: "n", arg: 3, scope: !101, file: !3, line: 67, type: !108)
!116 = !DILocation(line: 67, column: 45, scope: !101)
!117 = !DILocalVariable(name: "nleft", scope: !101, file: !3, line: 68, type: !108)
!118 = !DILocation(line: 68, column: 12, scope: !101)
!119 = !DILocation(line: 68, column: 20, scope: !101)
!120 = !DILocalVariable(name: "nwritten", scope: !101, file: !3, line: 69, type: !104)
!121 = !DILocation(line: 69, column: 13, scope: !101)
!122 = !DILocalVariable(name: "bufp", scope: !101, file: !3, line: 70, type: !52)
!123 = !DILocation(line: 70, column: 11, scope: !101)
!124 = !DILocation(line: 70, column: 18, scope: !101)
!125 = !DILocation(line: 72, column: 5, scope: !101)
!126 = !DILocation(line: 72, column: 12, scope: !101)
!127 = !DILocation(line: 72, column: 18, scope: !101)
!128 = !DILocation(line: 73, column: 31, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 73, column: 13)
!130 = distinct !DILexicalBlock(scope: !101, file: !3, line: 72, column: 22)
!131 = !DILocation(line: 73, column: 35, scope: !129)
!132 = !DILocation(line: 73, column: 41, scope: !129)
!133 = !DILocation(line: 73, column: 25, scope: !129)
!134 = !DILocation(line: 73, column: 23, scope: !129)
!135 = !DILocation(line: 73, column: 49, scope: !129)
!136 = !DILocation(line: 73, column: 13, scope: !130)
!137 = !DILocation(line: 74, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !139, file: !3, line: 74, column: 17)
!139 = distinct !DILexicalBlock(scope: !129, file: !3, line: 73, column: 54)
!140 = !DILocation(line: 74, column: 23, scope: !138)
!141 = !DILocation(line: 74, column: 17, scope: !139)
!142 = !DILocation(line: 75, column: 26, scope: !138)
!143 = !DILocation(line: 75, column: 17, scope: !138)
!144 = !DILocation(line: 77, column: 17, scope: !138)
!145 = !DILocation(line: 78, column: 9, scope: !139)
!146 = !DILocation(line: 79, column: 18, scope: !130)
!147 = !DILocation(line: 79, column: 15, scope: !130)
!148 = !DILocation(line: 80, column: 17, scope: !130)
!149 = !DILocation(line: 80, column: 14, scope: !130)
!150 = distinct !{!150, !125, !151}
!151 = !DILocation(line: 81, column: 5, scope: !101)
!152 = !DILocation(line: 82, column: 12, scope: !101)
!153 = !DILocation(line: 82, column: 5, scope: !101)
!154 = !DILocation(line: 83, column: 1, scope: !101)
!155 = distinct !DISubprogram(name: "rio_readlineb", scope: !3, file: !3, line: 124, type: !156, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!156 = !DISubroutineType(types: !157)
!157 = !{!104, !72, !20, !108}
!158 = !DILocalVariable(name: "rp", arg: 1, scope: !155, file: !3, line: 124, type: !72)
!159 = !DILocation(line: 124, column: 30, scope: !155)
!160 = !DILocalVariable(name: "usrbuf", arg: 2, scope: !155, file: !3, line: 124, type: !20)
!161 = !DILocation(line: 124, column: 40, scope: !155)
!162 = !DILocalVariable(name: "maxlen", arg: 3, scope: !155, file: !3, line: 124, type: !108)
!163 = !DILocation(line: 124, column: 55, scope: !155)
!164 = !DILocalVariable(name: "n", scope: !155, file: !3, line: 125, type: !48)
!165 = !DILocation(line: 125, column: 9, scope: !155)
!166 = !DILocalVariable(name: "rc", scope: !155, file: !3, line: 125, type: !48)
!167 = !DILocation(line: 125, column: 12, scope: !155)
!168 = !DILocalVariable(name: "c", scope: !155, file: !3, line: 126, type: !40)
!169 = !DILocation(line: 126, column: 10, scope: !155)
!170 = !DILocalVariable(name: "bufp", scope: !155, file: !3, line: 126, type: !52)
!171 = !DILocation(line: 126, column: 14, scope: !155)
!172 = !DILocation(line: 126, column: 21, scope: !155)
!173 = !DILocation(line: 128, column: 12, scope: !174)
!174 = distinct !DILexicalBlock(scope: !155, file: !3, line: 128, column: 5)
!175 = !DILocation(line: 128, column: 10, scope: !174)
!176 = !DILocation(line: 128, column: 17, scope: !177)
!177 = distinct !DILexicalBlock(scope: !174, file: !3, line: 128, column: 5)
!178 = !DILocation(line: 128, column: 21, scope: !177)
!179 = !DILocation(line: 128, column: 19, scope: !177)
!180 = !DILocation(line: 128, column: 5, scope: !174)
!181 = !DILocation(line: 129, column: 28, scope: !182)
!182 = distinct !DILexicalBlock(scope: !183, file: !3, line: 129, column: 13)
!183 = distinct !DILexicalBlock(scope: !177, file: !3, line: 128, column: 33)
!184 = !DILocation(line: 129, column: 19, scope: !182)
!185 = !DILocation(line: 129, column: 17, scope: !182)
!186 = !DILocation(line: 129, column: 40, scope: !182)
!187 = !DILocation(line: 129, column: 13, scope: !183)
!188 = !DILocation(line: 130, column: 23, scope: !189)
!189 = distinct !DILexicalBlock(scope: !182, file: !3, line: 129, column: 45)
!190 = !DILocation(line: 130, column: 18, scope: !189)
!191 = !DILocation(line: 130, column: 21, scope: !189)
!192 = !DILocation(line: 131, column: 17, scope: !193)
!193 = distinct !DILexicalBlock(scope: !189, file: !3, line: 131, column: 17)
!194 = !DILocation(line: 131, column: 19, scope: !193)
!195 = !DILocation(line: 131, column: 17, scope: !189)
!196 = !DILocation(line: 132, column: 17, scope: !193)
!197 = !DILocation(line: 133, column: 9, scope: !189)
!198 = !DILocation(line: 133, column: 20, scope: !199)
!199 = distinct !DILexicalBlock(scope: !182, file: !3, line: 133, column: 20)
!200 = !DILocation(line: 133, column: 23, scope: !199)
!201 = !DILocation(line: 133, column: 20, scope: !182)
!202 = !DILocation(line: 134, column: 17, scope: !203)
!203 = distinct !DILexicalBlock(scope: !204, file: !3, line: 134, column: 17)
!204 = distinct !DILexicalBlock(scope: !199, file: !3, line: 133, column: 28)
!205 = !DILocation(line: 134, column: 19, scope: !203)
!206 = !DILocation(line: 134, column: 17, scope: !204)
!207 = !DILocation(line: 135, column: 17, scope: !203)
!208 = !DILocation(line: 137, column: 17, scope: !203)
!209 = !DILocation(line: 139, column: 13, scope: !199)
!210 = !DILocation(line: 140, column: 5, scope: !183)
!211 = !DILocation(line: 128, column: 30, scope: !177)
!212 = !DILocation(line: 128, column: 5, scope: !177)
!213 = distinct !{!213, !180, !214}
!214 = !DILocation(line: 140, column: 5, scope: !174)
!215 = !DILocation(line: 141, column: 6, scope: !155)
!216 = !DILocation(line: 141, column: 11, scope: !155)
!217 = !DILocation(line: 142, column: 12, scope: !155)
!218 = !DILocation(line: 142, column: 5, scope: !155)
!219 = !DILocation(line: 143, column: 1, scope: !155)
!220 = distinct !DISubprogram(name: "rio_read", scope: !3, file: !3, line: 95, type: !221, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !83)
!221 = !DISubroutineType(types: !222)
!222 = !{!104, !72, !52, !108}
!223 = !DILocalVariable(name: "rp", arg: 1, scope: !220, file: !3, line: 95, type: !72)
!224 = !DILocation(line: 95, column: 32, scope: !220)
!225 = !DILocalVariable(name: "usrbuf", arg: 2, scope: !220, file: !3, line: 95, type: !52)
!226 = !DILocation(line: 95, column: 42, scope: !220)
!227 = !DILocalVariable(name: "n", arg: 3, scope: !220, file: !3, line: 95, type: !108)
!228 = !DILocation(line: 95, column: 57, scope: !220)
!229 = !DILocalVariable(name: "cnt", scope: !220, file: !3, line: 96, type: !48)
!230 = !DILocation(line: 96, column: 9, scope: !220)
!231 = !DILocation(line: 97, column: 5, scope: !220)
!232 = !DILocation(line: 97, column: 12, scope: !220)
!233 = !DILocation(line: 97, column: 16, scope: !220)
!234 = !DILocation(line: 97, column: 24, scope: !220)
!235 = !DILocation(line: 99, column: 28, scope: !236)
!236 = distinct !DILexicalBlock(scope: !220, file: !3, line: 97, column: 29)
!237 = !DILocation(line: 99, column: 32, scope: !236)
!238 = !DILocation(line: 99, column: 40, scope: !236)
!239 = !DILocation(line: 99, column: 44, scope: !236)
!240 = !DILocation(line: 99, column: 23, scope: !236)
!241 = !DILocation(line: 99, column: 9, scope: !236)
!242 = !DILocation(line: 99, column: 13, scope: !236)
!243 = !DILocation(line: 99, column: 21, scope: !236)
!244 = !DILocation(line: 101, column: 13, scope: !245)
!245 = distinct !DILexicalBlock(scope: !236, file: !3, line: 101, column: 13)
!246 = !DILocation(line: 101, column: 17, scope: !245)
!247 = !DILocation(line: 101, column: 25, scope: !245)
!248 = !DILocation(line: 101, column: 13, scope: !236)
!249 = !DILocation(line: 102, column: 17, scope: !250)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 102, column: 17)
!251 = distinct !DILexicalBlock(scope: !245, file: !3, line: 101, column: 29)
!252 = !DILocation(line: 102, column: 23, scope: !250)
!253 = !DILocation(line: 102, column: 17, scope: !251)
!254 = !DILocation(line: 103, column: 17, scope: !250)
!255 = !DILocation(line: 104, column: 9, scope: !251)
!256 = !DILocation(line: 105, column: 18, scope: !257)
!257 = distinct !DILexicalBlock(scope: !245, file: !3, line: 105, column: 18)
!258 = !DILocation(line: 105, column: 22, scope: !257)
!259 = !DILocation(line: 105, column: 30, scope: !257)
!260 = !DILocation(line: 105, column: 18, scope: !245)
!261 = !DILocation(line: 106, column: 13, scope: !257)
!262 = !DILocation(line: 108, column: 30, scope: !257)
!263 = !DILocation(line: 108, column: 34, scope: !257)
!264 = !DILocation(line: 108, column: 13, scope: !257)
!265 = !DILocation(line: 108, column: 17, scope: !257)
!266 = !DILocation(line: 108, column: 28, scope: !257)
!267 = distinct !{!267, !231, !268}
!268 = !DILocation(line: 109, column: 5, scope: !220)
!269 = !DILocation(line: 112, column: 11, scope: !220)
!270 = !DILocation(line: 112, column: 9, scope: !220)
!271 = !DILocation(line: 113, column: 9, scope: !272)
!272 = distinct !DILexicalBlock(scope: !220, file: !3, line: 113, column: 9)
!273 = !DILocation(line: 113, column: 13, scope: !272)
!274 = !DILocation(line: 113, column: 23, scope: !272)
!275 = !DILocation(line: 113, column: 21, scope: !272)
!276 = !DILocation(line: 113, column: 9, scope: !220)
!277 = !DILocation(line: 114, column: 15, scope: !272)
!278 = !DILocation(line: 114, column: 19, scope: !272)
!279 = !DILocation(line: 114, column: 13, scope: !272)
!280 = !DILocation(line: 114, column: 9, scope: !272)
!281 = !DILocation(line: 115, column: 12, scope: !220)
!282 = !DILocation(line: 115, column: 20, scope: !220)
!283 = !DILocation(line: 115, column: 24, scope: !220)
!284 = !DILocation(line: 115, column: 36, scope: !220)
!285 = !DILocation(line: 115, column: 5, scope: !220)
!286 = !DILocation(line: 116, column: 23, scope: !220)
!287 = !DILocation(line: 116, column: 5, scope: !220)
!288 = !DILocation(line: 116, column: 9, scope: !220)
!289 = !DILocation(line: 116, column: 20, scope: !220)
!290 = !DILocation(line: 117, column: 20, scope: !220)
!291 = !DILocation(line: 117, column: 5, scope: !220)
!292 = !DILocation(line: 117, column: 9, scope: !220)
!293 = !DILocation(line: 117, column: 17, scope: !220)
!294 = !DILocation(line: 118, column: 12, scope: !220)
!295 = !DILocation(line: 118, column: 5, scope: !220)
!296 = !DILocation(line: 119, column: 1, scope: !220)
!297 = distinct !DISubprogram(name: "format_size", scope: !3, file: !3, line: 145, type: !298, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !52, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !302, line: 46, size: 1152, elements: !303)
!302 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!303 = !{!304, !306, !308, !310, !312, !314, !316, !317, !318, !320, !322, !324, !332, !333, !334}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !301, file: !302, line: 48, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !28, line: 145, baseType: !110)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !301, file: !302, line: 53, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !28, line: 148, baseType: !110)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !301, file: !302, line: 61, baseType: !309, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !28, line: 151, baseType: !110)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !301, file: !302, line: 62, baseType: !311, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !28, line: 150, baseType: !7)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !301, file: !302, line: 64, baseType: !313, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !28, line: 146, baseType: !7)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !301, file: !302, line: 65, baseType: !315, size: 32, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !28, line: 147, baseType: !7)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !301, file: !302, line: 67, baseType: !48, size: 32, offset: 288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !301, file: !302, line: 69, baseType: !305, size: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !301, file: !302, line: 74, baseType: !319, size: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 152, baseType: !107)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !301, file: !302, line: 78, baseType: !321, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !28, line: 174, baseType: !107)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !301, file: !302, line: 80, baseType: !323, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !28, line: 179, baseType: !107)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !301, file: !302, line: 91, baseType: !325, size: 128, offset: 576)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !326, line: 9, size: 128, elements: !327)
!326 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!327 = !{!328, !330}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !325, file: !326, line: 11, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !28, line: 160, baseType: !107)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !325, file: !326, line: 12, baseType: !331, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !28, line: 196, baseType: !107)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !301, file: !302, line: 92, baseType: !325, size: 128, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !301, file: !302, line: 93, baseType: !325, size: 128, offset: 832)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !301, file: !302, line: 106, baseType: !335, size: 192, offset: 960)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 192, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 3)
!338 = !DILocalVariable(name: "buf", arg: 1, scope: !297, file: !3, line: 145, type: !52)
!339 = !DILocation(line: 145, column: 24, scope: !297)
!340 = !DILocalVariable(name: "stat", arg: 2, scope: !297, file: !3, line: 145, type: !300)
!341 = !DILocation(line: 145, column: 42, scope: !297)
!342 = !DILocation(line: 146, column: 8, scope: !343)
!343 = distinct !DILexicalBlock(scope: !297, file: !3, line: 146, column: 8)
!344 = !DILocation(line: 146, column: 8, scope: !297)
!345 = !DILocation(line: 147, column: 17, scope: !346)
!346 = distinct !DILexicalBlock(scope: !343, file: !3, line: 146, column: 31)
!347 = !DILocation(line: 147, column: 9, scope: !346)
!348 = !DILocation(line: 148, column: 5, scope: !346)
!349 = !DILocalVariable(name: "size", scope: !350, file: !3, line: 149, type: !351)
!350 = distinct !DILexicalBlock(scope: !343, file: !3, line: 148, column: 12)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !105, line: 85, baseType: !319)
!352 = !DILocation(line: 149, column: 15, scope: !350)
!353 = !DILocation(line: 149, column: 22, scope: !350)
!354 = !DILocation(line: 149, column: 28, scope: !350)
!355 = !DILocation(line: 150, column: 12, scope: !356)
!356 = distinct !DILexicalBlock(scope: !350, file: !3, line: 150, column: 12)
!357 = !DILocation(line: 150, column: 17, scope: !356)
!358 = !DILocation(line: 150, column: 12, scope: !350)
!359 = !DILocation(line: 151, column: 21, scope: !360)
!360 = distinct !DILexicalBlock(scope: !356, file: !3, line: 150, column: 24)
!361 = !DILocation(line: 151, column: 33, scope: !360)
!362 = !DILocation(line: 151, column: 13, scope: !360)
!363 = !DILocation(line: 152, column: 9, scope: !360)
!364 = !DILocation(line: 152, column: 20, scope: !365)
!365 = distinct !DILexicalBlock(scope: !356, file: !3, line: 152, column: 20)
!366 = !DILocation(line: 152, column: 25, scope: !365)
!367 = !DILocation(line: 152, column: 20, scope: !356)
!368 = !DILocation(line: 153, column: 21, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !3, line: 152, column: 39)
!370 = !DILocation(line: 153, column: 43, scope: !369)
!371 = !DILocation(line: 153, column: 35, scope: !369)
!372 = !DILocation(line: 153, column: 48, scope: !369)
!373 = !DILocation(line: 153, column: 13, scope: !369)
!374 = !DILocation(line: 154, column: 9, scope: !369)
!375 = !DILocation(line: 154, column: 20, scope: !376)
!376 = distinct !DILexicalBlock(scope: !365, file: !3, line: 154, column: 20)
!377 = !DILocation(line: 154, column: 25, scope: !376)
!378 = !DILocation(line: 154, column: 20, scope: !365)
!379 = !DILocation(line: 155, column: 21, scope: !380)
!380 = distinct !DILexicalBlock(scope: !376, file: !3, line: 154, column: 46)
!381 = !DILocation(line: 155, column: 43, scope: !380)
!382 = !DILocation(line: 155, column: 35, scope: !380)
!383 = !DILocation(line: 155, column: 48, scope: !380)
!384 = !DILocation(line: 155, column: 55, scope: !380)
!385 = !DILocation(line: 155, column: 13, scope: !380)
!386 = !DILocation(line: 156, column: 9, scope: !380)
!387 = !DILocation(line: 157, column: 21, scope: !388)
!388 = distinct !DILexicalBlock(scope: !376, file: !3, line: 156, column: 16)
!389 = !DILocation(line: 157, column: 43, scope: !388)
!390 = !DILocation(line: 157, column: 35, scope: !388)
!391 = !DILocation(line: 157, column: 48, scope: !388)
!392 = !DILocation(line: 157, column: 55, scope: !388)
!393 = !DILocation(line: 157, column: 62, scope: !388)
!394 = !DILocation(line: 157, column: 13, scope: !388)
!395 = !DILocation(line: 160, column: 1, scope: !297)
!396 = distinct !DISubprogram(name: "handle_directory_request", scope: !3, file: !3, line: 162, type: !397, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !48, !48, !52}
!399 = !DILocalVariable(name: "out_fd", arg: 1, scope: !396, file: !3, line: 162, type: !48)
!400 = !DILocation(line: 162, column: 35, scope: !396)
!401 = !DILocalVariable(name: "dir_fd", arg: 2, scope: !396, file: !3, line: 162, type: !48)
!402 = !DILocation(line: 162, column: 47, scope: !396)
!403 = !DILocalVariable(name: "filename", arg: 3, scope: !396, file: !3, line: 162, type: !52)
!404 = !DILocation(line: 162, column: 61, scope: !396)
!405 = !DILocalVariable(name: "buf", scope: !396, file: !3, line: 163, type: !80)
!406 = !DILocation(line: 163, column: 10, scope: !396)
!407 = !DILocalVariable(name: "m_time", scope: !396, file: !3, line: 163, type: !408)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 32)
!411 = !DILocation(line: 163, column: 24, scope: !396)
!412 = !DILocalVariable(name: "size", scope: !396, file: !3, line: 163, type: !413)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 16)
!416 = !DILocation(line: 163, column: 36, scope: !396)
!417 = !DILocalVariable(name: "statbuf", scope: !396, file: !3, line: 164, type: !301)
!418 = !DILocation(line: 164, column: 17, scope: !396)
!419 = !DILocation(line: 165, column: 13, scope: !396)
!420 = !DILocation(line: 165, column: 5, scope: !396)
!421 = !DILocation(line: 171, column: 12, scope: !396)
!422 = !DILocation(line: 171, column: 20, scope: !396)
!423 = !DILocation(line: 171, column: 32, scope: !396)
!424 = !DILocation(line: 171, column: 25, scope: !396)
!425 = !DILocation(line: 171, column: 5, scope: !396)
!426 = !DILocalVariable(name: "d", scope: !396, file: !3, line: 172, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !429, line: 127, baseType: !430)
!429 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !429, line: 127, flags: DIFlagFwdDecl)
!431 = !DILocation(line: 172, column: 10, scope: !396)
!432 = !DILocation(line: 172, column: 24, scope: !396)
!433 = !DILocation(line: 172, column: 14, scope: !396)
!434 = !DILocalVariable(name: "dp", scope: !396, file: !3, line: 173, type: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !437, line: 22, size: 2240, elements: !438)
!437 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!438 = !{!439, !440, !441, !442, !444}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !436, file: !437, line: 25, baseType: !307, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !436, file: !437, line: 26, baseType: !319, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !436, file: !437, line: 31, baseType: !29, size: 16, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !436, file: !437, line: 32, baseType: !443, size: 8, offset: 144)
!443 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !436, file: !437, line: 33, baseType: !445, size: 2048, offset: 152)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 256)
!448 = !DILocation(line: 173, column: 20, scope: !396)
!449 = !DILocalVariable(name: "ffd", scope: !396, file: !3, line: 174, type: !48)
!450 = !DILocation(line: 174, column: 9, scope: !396)
!451 = !DILocation(line: 175, column: 5, scope: !396)
!452 = !DILocation(line: 175, column: 26, scope: !396)
!453 = !DILocation(line: 175, column: 18, scope: !396)
!454 = !DILocation(line: 175, column: 16, scope: !396)
!455 = !DILocation(line: 175, column: 30, scope: !396)
!456 = !DILocation(line: 176, column: 20, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !3, line: 176, column: 12)
!458 = distinct !DILexicalBlock(scope: !396, file: !3, line: 175, column: 38)
!459 = !DILocation(line: 176, column: 24, scope: !457)
!460 = !DILocation(line: 176, column: 13, scope: !457)
!461 = !DILocation(line: 176, column: 37, scope: !457)
!462 = !DILocation(line: 176, column: 48, scope: !457)
!463 = !DILocation(line: 176, column: 52, scope: !457)
!464 = !DILocation(line: 176, column: 41, scope: !457)
!465 = !DILocation(line: 176, column: 12, scope: !458)
!466 = !DILocation(line: 177, column: 13, scope: !467)
!467 = distinct !DILexicalBlock(scope: !457, file: !3, line: 176, column: 66)
!468 = distinct !{!468, !451, !469}
!469 = !DILocation(line: 194, column: 5, scope: !396)
!470 = !DILocation(line: 179, column: 27, scope: !471)
!471 = distinct !DILexicalBlock(scope: !458, file: !3, line: 179, column: 13)
!472 = !DILocation(line: 179, column: 35, scope: !471)
!473 = !DILocation(line: 179, column: 39, scope: !471)
!474 = !DILocation(line: 179, column: 20, scope: !471)
!475 = !DILocation(line: 179, column: 18, scope: !471)
!476 = !DILocation(line: 179, column: 58, scope: !471)
!477 = !DILocation(line: 179, column: 13, scope: !458)
!478 = !DILocation(line: 180, column: 20, scope: !479)
!479 = distinct !DILexicalBlock(scope: !471, file: !3, line: 179, column: 64)
!480 = !DILocation(line: 180, column: 24, scope: !479)
!481 = !DILocation(line: 180, column: 13, scope: !479)
!482 = !DILocation(line: 181, column: 13, scope: !479)
!483 = !DILocation(line: 183, column: 15, scope: !458)
!484 = !DILocation(line: 183, column: 9, scope: !458)
!485 = !DILocation(line: 184, column: 18, scope: !458)
!486 = !DILocation(line: 185, column: 55, scope: !458)
!487 = !DILocation(line: 185, column: 36, scope: !458)
!488 = !DILocation(line: 184, column: 9, scope: !458)
!489 = !DILocation(line: 186, column: 21, scope: !458)
!490 = !DILocation(line: 186, column: 9, scope: !458)
!491 = !DILocation(line: 187, column: 12, scope: !492)
!492 = distinct !DILexicalBlock(scope: !458, file: !3, line: 187, column: 12)
!493 = !DILocation(line: 187, column: 37, scope: !492)
!494 = !DILocation(line: 187, column: 40, scope: !492)
!495 = !DILocation(line: 187, column: 12, scope: !458)
!496 = !DILocalVariable(name: "d", scope: !497, file: !3, line: 188, type: !52)
!497 = distinct !DILexicalBlock(scope: !492, file: !3, line: 187, column: 65)
!498 = !DILocation(line: 188, column: 19, scope: !497)
!499 = !DILocation(line: 188, column: 23, scope: !497)
!500 = !DILocation(line: 189, column: 21, scope: !497)
!501 = !DILocation(line: 190, column: 21, scope: !497)
!502 = !DILocation(line: 190, column: 25, scope: !497)
!503 = !DILocation(line: 190, column: 33, scope: !497)
!504 = !DILocation(line: 190, column: 36, scope: !497)
!505 = !DILocation(line: 190, column: 40, scope: !497)
!506 = !DILocation(line: 190, column: 48, scope: !497)
!507 = !DILocation(line: 190, column: 51, scope: !497)
!508 = !DILocation(line: 190, column: 59, scope: !497)
!509 = !DILocation(line: 189, column: 13, scope: !497)
!510 = !DILocation(line: 191, column: 20, scope: !497)
!511 = !DILocation(line: 191, column: 28, scope: !497)
!512 = !DILocation(line: 191, column: 40, scope: !497)
!513 = !DILocation(line: 191, column: 33, scope: !497)
!514 = !DILocation(line: 191, column: 13, scope: !497)
!515 = !DILocation(line: 192, column: 9, scope: !497)
!516 = !DILocation(line: 193, column: 15, scope: !458)
!517 = !DILocation(line: 193, column: 9, scope: !458)
!518 = !DILocation(line: 195, column: 13, scope: !396)
!519 = !DILocation(line: 195, column: 5, scope: !396)
!520 = !DILocation(line: 196, column: 12, scope: !396)
!521 = !DILocation(line: 196, column: 20, scope: !396)
!522 = !DILocation(line: 196, column: 32, scope: !396)
!523 = !DILocation(line: 196, column: 25, scope: !396)
!524 = !DILocation(line: 196, column: 5, scope: !396)
!525 = !DILocation(line: 197, column: 14, scope: !396)
!526 = !DILocation(line: 197, column: 5, scope: !396)
!527 = !DILocation(line: 198, column: 1, scope: !396)
!528 = distinct !DISubprogram(name: "open_listenfd", scope: !3, file: !3, line: 215, type: !529, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!529 = !DISubroutineType(types: !530)
!530 = !{!48, !48}
!531 = !DILocalVariable(name: "port", arg: 1, scope: !528, file: !3, line: 215, type: !48)
!532 = !DILocation(line: 215, column: 23, scope: !528)
!533 = !DILocalVariable(name: "listenfd", scope: !528, file: !3, line: 216, type: !48)
!534 = !DILocation(line: 216, column: 9, scope: !528)
!535 = !DILocalVariable(name: "optval", scope: !528, file: !3, line: 216, type: !48)
!536 = !DILocation(line: 216, column: 19, scope: !528)
!537 = !DILocalVariable(name: "serveraddr", scope: !528, file: !3, line: 217, type: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !24, line: 237, size: 128, elements: !539)
!539 = !{!540, !541, !545, !549}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !538, file: !24, line: 239, baseType: !36, size: 16)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !538, file: !24, line: 240, baseType: !542, size: 16, offset: 16)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !24, line: 119, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 25, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !28, line: 40, baseType: !29)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !538, file: !24, line: 241, baseType: !546, size: 32, offset: 32)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !24, line: 31, size: 32, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !546, file: !24, line: 33, baseType: !23, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !538, file: !24, line: 244, baseType: !550, size: 64, offset: 64)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 64, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 8)
!553 = !DILocation(line: 217, column: 24, scope: !528)
!554 = !DILocation(line: 220, column: 21, scope: !555)
!555 = distinct !DILexicalBlock(scope: !528, file: !3, line: 220, column: 9)
!556 = !DILocation(line: 220, column: 19, scope: !555)
!557 = !DILocation(line: 220, column: 54, scope: !555)
!558 = !DILocation(line: 220, column: 9, scope: !528)
!559 = !DILocation(line: 221, column: 9, scope: !555)
!560 = !DILocation(line: 224, column: 20, scope: !561)
!561 = distinct !DILexicalBlock(scope: !528, file: !3, line: 224, column: 9)
!562 = !DILocation(line: 225, column: 20, scope: !561)
!563 = !DILocation(line: 224, column: 9, scope: !561)
!564 = !DILocation(line: 225, column: 57, scope: !561)
!565 = !DILocation(line: 224, column: 9, scope: !528)
!566 = !DILocation(line: 226, column: 9, scope: !561)
!567 = !DILocation(line: 230, column: 20, scope: !568)
!568 = distinct !DILexicalBlock(scope: !528, file: !3, line: 230, column: 9)
!569 = !DILocation(line: 231, column: 20, scope: !568)
!570 = !DILocation(line: 230, column: 9, scope: !568)
!571 = !DILocation(line: 231, column: 57, scope: !568)
!572 = !DILocation(line: 230, column: 9, scope: !528)
!573 = !DILocation(line: 232, column: 9, scope: !568)
!574 = !DILocation(line: 236, column: 5, scope: !528)
!575 = !DILocation(line: 237, column: 16, scope: !528)
!576 = !DILocation(line: 237, column: 27, scope: !528)
!577 = !DILocation(line: 238, column: 34, scope: !528)
!578 = !DILocation(line: 238, column: 16, scope: !528)
!579 = !DILocation(line: 238, column: 25, scope: !528)
!580 = !DILocation(line: 238, column: 32, scope: !528)
!581 = !DILocation(line: 239, column: 49, scope: !528)
!582 = !DILocation(line: 239, column: 33, scope: !528)
!583 = !DILocation(line: 239, column: 27, scope: !528)
!584 = !DILocation(line: 239, column: 16, scope: !528)
!585 = !DILocation(line: 239, column: 25, scope: !528)
!586 = !DILocation(line: 240, column: 14, scope: !587)
!587 = distinct !DILexicalBlock(scope: !528, file: !3, line: 240, column: 9)
!588 = !DILocation(line: 240, column: 24, scope: !587)
!589 = !DILocation(line: 240, column: 9, scope: !587)
!590 = !DILocation(line: 240, column: 63, scope: !587)
!591 = !DILocation(line: 240, column: 9, scope: !528)
!592 = !DILocation(line: 241, column: 9, scope: !587)
!593 = !DILocation(line: 244, column: 16, scope: !594)
!594 = distinct !DILexicalBlock(scope: !528, file: !3, line: 244, column: 9)
!595 = !DILocation(line: 244, column: 9, scope: !594)
!596 = !DILocation(line: 244, column: 35, scope: !594)
!597 = !DILocation(line: 244, column: 9, scope: !528)
!598 = !DILocation(line: 245, column: 9, scope: !594)
!599 = !DILocation(line: 246, column: 12, scope: !528)
!600 = !DILocation(line: 246, column: 5, scope: !528)
!601 = !DILocation(line: 247, column: 1, scope: !528)
!602 = distinct !DISubprogram(name: "url_decode", scope: !3, file: !3, line: 249, type: !603, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !52, !52, !48}
!605 = !DILocalVariable(name: "src", arg: 1, scope: !602, file: !3, line: 249, type: !52)
!606 = !DILocation(line: 249, column: 23, scope: !602)
!607 = !DILocalVariable(name: "dest", arg: 2, scope: !602, file: !3, line: 249, type: !52)
!608 = !DILocation(line: 249, column: 34, scope: !602)
!609 = !DILocalVariable(name: "max", arg: 3, scope: !602, file: !3, line: 249, type: !48)
!610 = !DILocation(line: 249, column: 44, scope: !602)
!611 = !DILocalVariable(name: "p", scope: !602, file: !3, line: 250, type: !52)
!612 = !DILocation(line: 250, column: 11, scope: !602)
!613 = !DILocation(line: 250, column: 15, scope: !602)
!614 = !DILocalVariable(name: "code", scope: !602, file: !3, line: 251, type: !615)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 24, elements: !336)
!616 = !DILocation(line: 251, column: 10, scope: !602)
!617 = !DILocation(line: 252, column: 5, scope: !602)
!618 = !DILocation(line: 252, column: 12, scope: !602)
!619 = !DILocation(line: 252, column: 11, scope: !602)
!620 = !DILocation(line: 252, column: 14, scope: !602)
!621 = !DILocation(line: 252, column: 17, scope: !602)
!622 = !DILocation(line: 0, scope: !602)
!623 = !DILocation(line: 253, column: 13, scope: !624)
!624 = distinct !DILexicalBlock(scope: !625, file: !3, line: 253, column: 12)
!625 = distinct !DILexicalBlock(scope: !602, file: !3, line: 252, column: 24)
!626 = !DILocation(line: 253, column: 12, scope: !624)
!627 = !DILocation(line: 253, column: 15, scope: !624)
!628 = !DILocation(line: 253, column: 12, scope: !625)
!629 = !DILocation(line: 254, column: 13, scope: !630)
!630 = distinct !DILexicalBlock(scope: !624, file: !3, line: 253, column: 23)
!631 = !DILocation(line: 254, column: 26, scope: !630)
!632 = !DILocation(line: 255, column: 37, scope: !630)
!633 = !DILocation(line: 255, column: 29, scope: !630)
!634 = !DILocation(line: 255, column: 23, scope: !630)
!635 = !DILocation(line: 255, column: 18, scope: !630)
!636 = !DILocation(line: 255, column: 21, scope: !630)
!637 = !DILocation(line: 256, column: 15, scope: !630)
!638 = !DILocation(line: 257, column: 9, scope: !630)
!639 = !DILocation(line: 258, column: 25, scope: !640)
!640 = distinct !DILexicalBlock(scope: !624, file: !3, line: 257, column: 16)
!641 = !DILocation(line: 258, column: 23, scope: !640)
!642 = !DILocation(line: 258, column: 18, scope: !640)
!643 = !DILocation(line: 258, column: 21, scope: !640)
!644 = distinct !{!644, !617, !645}
!645 = !DILocation(line: 260, column: 5, scope: !602)
!646 = !DILocation(line: 261, column: 6, scope: !602)
!647 = !DILocation(line: 261, column: 11, scope: !602)
!648 = !DILocation(line: 262, column: 1, scope: !602)
!649 = distinct !DISubprogram(name: "parse_request", scope: !3, file: !3, line: 264, type: !650, scopeLine: 264, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !48, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "http_request", file: !3, line: 36, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 32, size: 4224, elements: !655)
!655 = !{!656, !660, !661}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !654, file: !3, line: 33, baseType: !657, size: 4096)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !654, file: !3, line: 34, baseType: !351, size: 64, offset: 4096)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !654, file: !3, line: 35, baseType: !108, size: 64, offset: 4160)
!662 = !DILocalVariable(name: "fd", arg: 1, scope: !649, file: !3, line: 264, type: !48)
!663 = !DILocation(line: 264, column: 24, scope: !649)
!664 = !DILocalVariable(name: "req", arg: 2, scope: !649, file: !3, line: 264, type: !652)
!665 = !DILocation(line: 264, column: 42, scope: !649)
!666 = !DILocalVariable(name: "rio", scope: !649, file: !3, line: 265, type: !73)
!667 = !DILocation(line: 265, column: 11, scope: !649)
!668 = !DILocalVariable(name: "buf", scope: !649, file: !3, line: 266, type: !80)
!669 = !DILocation(line: 266, column: 10, scope: !649)
!670 = !DILocalVariable(name: "method", scope: !649, file: !3, line: 266, type: !80)
!671 = !DILocation(line: 266, column: 24, scope: !649)
!672 = !DILocalVariable(name: "uri", scope: !649, file: !3, line: 266, type: !80)
!673 = !DILocation(line: 266, column: 41, scope: !649)
!674 = !DILocation(line: 267, column: 5, scope: !649)
!675 = !DILocation(line: 267, column: 10, scope: !649)
!676 = !DILocation(line: 267, column: 17, scope: !649)
!677 = !DILocation(line: 268, column: 5, scope: !649)
!678 = !DILocation(line: 268, column: 10, scope: !649)
!679 = !DILocation(line: 268, column: 14, scope: !649)
!680 = !DILocation(line: 270, column: 25, scope: !649)
!681 = !DILocation(line: 270, column: 5, scope: !649)
!682 = !DILocation(line: 271, column: 25, scope: !649)
!683 = !DILocation(line: 271, column: 5, scope: !649)
!684 = !DILocation(line: 272, column: 12, scope: !649)
!685 = !DILocation(line: 272, column: 26, scope: !649)
!686 = !DILocation(line: 272, column: 34, scope: !649)
!687 = !DILocation(line: 272, column: 5, scope: !649)
!688 = !DILocation(line: 274, column: 5, scope: !649)
!689 = !DILocation(line: 274, column: 11, scope: !649)
!690 = !DILocation(line: 274, column: 18, scope: !649)
!691 = !DILocation(line: 274, column: 26, scope: !649)
!692 = !DILocation(line: 274, column: 29, scope: !649)
!693 = !DILocation(line: 274, column: 36, scope: !649)
!694 = !DILocation(line: 0, scope: !649)
!695 = !DILocation(line: 275, column: 29, scope: !696)
!696 = distinct !DILexicalBlock(scope: !649, file: !3, line: 274, column: 45)
!697 = !DILocation(line: 275, column: 9, scope: !696)
!698 = !DILocation(line: 276, column: 12, scope: !699)
!699 = distinct !DILexicalBlock(scope: !696, file: !3, line: 276, column: 12)
!700 = !DILocation(line: 276, column: 19, scope: !699)
!701 = !DILocation(line: 276, column: 26, scope: !699)
!702 = !DILocation(line: 276, column: 29, scope: !699)
!703 = !DILocation(line: 276, column: 36, scope: !699)
!704 = !DILocation(line: 276, column: 43, scope: !699)
!705 = !DILocation(line: 276, column: 46, scope: !699)
!706 = !DILocation(line: 276, column: 53, scope: !699)
!707 = !DILocation(line: 276, column: 12, scope: !696)
!708 = !DILocation(line: 277, column: 20, scope: !709)
!709 = distinct !DILexicalBlock(scope: !699, file: !3, line: 276, column: 60)
!710 = !DILocation(line: 277, column: 50, scope: !709)
!711 = !DILocation(line: 277, column: 55, scope: !709)
!712 = !DILocation(line: 277, column: 64, scope: !709)
!713 = !DILocation(line: 277, column: 69, scope: !709)
!714 = !DILocation(line: 277, column: 13, scope: !709)
!715 = !DILocation(line: 279, column: 17, scope: !716)
!716 = distinct !DILexicalBlock(scope: !709, file: !3, line: 279, column: 17)
!717 = !DILocation(line: 279, column: 22, scope: !716)
!718 = !DILocation(line: 279, column: 26, scope: !716)
!719 = !DILocation(line: 279, column: 17, scope: !709)
!720 = !DILocation(line: 279, column: 32, scope: !716)
!721 = !DILocation(line: 279, column: 37, scope: !716)
!722 = !DILocation(line: 279, column: 41, scope: !716)
!723 = !DILocation(line: 280, column: 9, scope: !709)
!724 = distinct !{!724, !688, !725}
!725 = !DILocation(line: 281, column: 5, scope: !649)
!726 = !DILocalVariable(name: "filename", scope: !649, file: !3, line: 282, type: !52)
!727 = !DILocation(line: 282, column: 11, scope: !649)
